<?php
/**
 * ============================================================================
 * 版权所有 2018-2027  sujianbin，并保留所有权利。
 * 网站地址: https://sujianbin.com
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用 .
 * 不允许对程序代码以任何形式任何目的的再发布。
 * 如果商业用途务必得到允许, 以免引起不必要的法律纠纷.
 * ============================================================================
 * Author: sujianbin
 * Date: 2018-09-14
 */
namespace app\admin\validate;

use think\Validate;

class About extends Validate
{
    //验证规则
    protected $rule = [
        'cat_name' => 'require',
        'order_id' => 'between:1,999999',
    ];

    //错误提示
    protected $message = [
        'cat_name' => '栏目名称不能为空',
        'order_id' => '排序字段必须在1-999999之间',
    ];
}