<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    //数据库备份路径
    'back_up_path'           => 'upload/backupdata',
    //数据库备份卷大小
    'back_up_part'           => '20971520',
    //数据库备份文件是否启用压缩 0不压缩 1 压缩
    'back_up_compress'       => 0,
    //数据库备份文件压缩级别 1普通 4 一般  9最高
    'back_up_level'          => 9,
];